In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:query@localhost/test

In [3]:
%%sql
CREATE DATABASE zomato

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[]

In [18]:
%%sql
DROP TABLE IF EXISTS orders;

CREATE TABLE orders (
    order_id INT AUTO_INCREMENT PRIMARY KEY,
    user1_id INT,
    item_id INT,
    quantity INT NOT NULL,
    delivery_addr VARCHAR(255) NOT NULL,
    order_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [19]:
%%sql
INSERT INTO orders (user1_id, item_id, quantity, delivery_addr) VALUES
(1, 1, 2, '123 Main St'),
(2, 2, 1, '456 Oak Rd'),
(3, 3, 3, '789 Pine Ave');

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[]

In [20]:
%%sql
CREATE TABLE categories(
    category_id INT AUTO_INCREMENT PRIMARY KEY,
    category_name VARCHAR(200)NOT NULL
    );

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

In [21]:
%%sql
INSERT INTO categories (category_name) VALUES
('Vegetarian'),
('Non-Vegetarian'),
('Vegan');

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[]

In [22]:
%%sql
CREATE TABLE IF NOT EXISTS items (
    item_id INT AUTO_INCREMENT PRIMARY KEY,
    item_name VARCHAR(255) NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
    category_id INT
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

In [23]:
%%sql
INSERT INTO items (item_name, price, category_id) VALUES
('Biriyani', 150.00, 2),  
('Paneer', 100.00, 1),
('Butter Chicken', 200.00, 2);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[]

In [24]:
%%sql
CREATE TABLE IF NOT EXISTS order_items (
    order_item_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id INT,
    item_id INT,
    quantity INT NOT NULL,
    price DECIMAL(10, 2),
    FOREIGN KEY (item_id) REFERENCES items(item_id)
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

In [25]:
%%sql
INSERT INTO order_items (order_id, item_id, quantity, price) VALUES
(1, 1, 2, 150.00),
(2, 2, 1, 100.00),
(3, 3, 3, 200.00);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[]

In [26]:
%%sql
CREATE TABLE IF NOT EXISTS payments (
    payment_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id INT,
    payment_method VARCHAR(50),
    payment_status VARCHAR(50),
    amount DECIMAL(10, 2),
    paid_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

In [27]:
%%sql
INSERT INTO payments (order_id, payment_method, payment_status, amount) VALUES
(1, 'Credit Card', 'Paid', 300.00),
(2, 'Debit Card', 'Paid', 100.00),
(3, 'GPay', 'Pending', 600.00);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[]

In [32]:
%%sql
CREATE TABLE IF NOT EXISTS customers11(
    user_id INT PRIMARY KEY,
    first_name VARCHAR(255),
    last_name VARCHAR(255),
    phone_number VARCHAR(15),
    email VARCHAR(255)
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

In [33]:
%%sql
INSERT INTO customers11 (user_id, first_name, last_name, phone_number, email) VALUES
(1, 'John', 'Doe', '123-456-7890', 'john.doe@example.com'),
(2, 'Jane', 'Smith', '987-654-3210', 'jane.smith@example.com'),
(3, 'Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com'),
(4, 'Bob', 'Brown', '444-555-6666', 'bob.brown@example.com'),
(5, 'Gowtham', 'Kumar', '777-888-9999', 'gowtham.kumar@example.com');

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[]

In [ ]:
ETL STARTS HERE THERE ARE 12 QUESTIONS HERE

In [ ]:
1. Total Revenue from All Orders

In [35]:
%%sql
select SUM(oi.quantity * oi.price) AS total_revenue
FROM order_items oi;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(Decimal('1000.00'),)]

In [ ]:
2. Revenue by Item

In [36]:
%%sql
select i.item_name,SUM(oi.quantity * oi.price) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id=i.item_id
GROUP BY i.item_name
ORDER BY total_revenue DESC;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Butter Chicken', Decimal('600.00')),
 ('Biriyani', Decimal('300.00')),
 ('Paneer', Decimal('100.00'))]

In [ ]:
3. Revenue by Payment Method

In [37]:
%%sql
select p.payment_method,SUM(p.amount) AS total_revenue
FROM payments p
JOIN orders oi ON p.order_id=oi.order_id
GROUP BY payment_method;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Credit Card', Decimal('300.00')),
 ('Debit Card', Decimal('100.00')),
 ('GPay', Decimal('600.00'))]

In [ ]:
4. Total Revenue by Date

In [38]:
%%sql
select DATE(p.paid_at) AS date, SUM(p.amount) AS daily_revenue
FROM payments p
GROUP BY DATE(paid_at)
ORDER BY date;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(datetime.date(2025, 8, 9), Decimal('1000.00'))]

In [ ]:
5. Total Orders and Revenue by User

In [44]:
%%sql
select 
    u.first_name,
    u.last_name,
    u.phone_number,
    u.email,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers11 u ON o.user1_id = u.user_id
GROUP BY u.user_id
ORDER BY total_revenue DESC;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 1, Decimal('600.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, Decimal('300.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 1, Decimal('100.00'))]

In [ ]:
6. Items Ordered by Category

In [9]:
%%sql
select i.item_name ,c.category_name,SUM(oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON i.item_id=oi.item_id
JOIN categories c ON i.category_id=c.category_id
GROUP BY i.item_name,c.category_name
ORDER BY total_revenue DESC;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Butter Chicken', 'Non-Vegetarian', Decimal('3')),
 ('Biriyani', 'Non-Vegetarian', Decimal('2')),
 ('Paneer', 'Vegetarian', Decimal('1'))]

In [ ]:
7.ORDER BY PAYMENT STATUS

In [10]:
%%sql
select p.payment_status,COUNT(o.order_id) AS total_order
FROM payments p
JOIN orders o ON o.order_id=p.order_id
GROUP BY p.payment_status;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Paid', 2), ('Pending', 1)]

In [ ]:
8.users with most orders

In [13]:
%%sql
SELECT 
    u.first_name,
    u.last_name,
    COUNT(o.order_id) AS total_orders
FROM customers11 u
JOIN orders o ON o.user1_id=u.user_id
GROUP BY u.user_id
ORDER BY total_orders DESC;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('John', 'Doe', 1), ('Jane', 'Smith', 1), ('Alice', 'Johnson', 1)]

In [ ]:
9.REVENUE BY CATEGORY

In [15]:
%%sql
select c.category_name,SUM(oi.price*oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON i.item_id=oi.item_id
JOIN categories c ON i.category_id=c.category_id
GROUP BY  c.category_name;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Non-Vegetarian', Decimal('900.00')), ('Vegetarian', Decimal('100.00'))]

In [ ]:
10.customer details with orders

In [20]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    o.order_id, 
    o.delivery_addr, 
    oi.item_id, 
    oi.quantity
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers11 c ON o.user1_id = c.user_id;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, '123 Main St', 1, 2),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, '456 Oak Rd', 2, 1),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 3, '789 Pine Ave', 3, 3)]

In [ ]:
11.Items Purchased in Specific Order

In [21]:
%%sql
SELECT oi.order_id, i.item_name, oi.quantity, oi.price
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
WHERE oi.order_id = 1;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(1, 'Biriyani', 2, Decimal('150.00'))]

In [ ]:
12.. Revenue by Customer

In [23]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers11 c ON o.user1_id = c.user_id
GROUP BY c.user_id

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('John', 'Doe', '123-456-7890', 'john.doe@example.com', Decimal('300.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', Decimal('100.00')),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', Decimal('600.00'))]

In [ ]:
joining concept
When to join tables:

You join when the data you need is split across multiple tables.

Look for a common column (usually an ID) that connects them.

How to decide which tables to join:

Check what columns you need in your final output.

If one table doesn’t have all those columns → you need to join another table.

Find the linking key (same data in both tables, like order_id, user_id).

Use JOIN to connect them so you can use columns from both tables.

Your query’s logic:

orders has who ordered and order ID.

order_items has what was ordered and price × quantity.

customers11 has customer info.

You join them so you can show customer name + contact + total revenue.

JOIN path here:
customers11.user_id ⟷ orders.user1_id ⟷ order_items.order_id